BODY
The constructor sets the data members of the AcDbFaceRef. The provided
ASM BODY is not copied, the caller is responsible for providing a copy,
if needed.
Returns the ASM BODY that the AcDbFaceRef may hold. It does not return a
copy of the ASM BODY, therefore the client code needs to make a copy if
it needs to do any modifications to this ASM BODY.